backend/tests/performance/companies.yml
config:
  target: "http://localhost:4200"
  phases:
    - duration: 1        # tiempo total de la prueba
      arrivalRate: 1     # usuarios virtuales por segundo
  variables:
    fixedToken: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwiZW1haWwiOiJwaXBldGVuaml0b0BnbWFpbC5jb20iLCJyb2xlIjoidXNlciIsImlhdCI6MTc1ODY0MTk3NywiZXhwIjoxNzU4NjQ1NTc3fQ.OCjZYYeclWh-VqKFYFBv8ldp38A2CqePdydv1Jd1X24"

scenarios:
  - name: "Flujo completo de Companies con token fijo"
    flow:
      # 1. Obtener lista de usuarios
      - get:
          url: "/api/companies"
          headers:
            Authorization: "Bearer {{ fixedToken }}"

      # 2. Obtener un usuario por id
      - get:
          url: "/api/companies/1"
          headers:
            Authorization: "Bearer {{ fixedToken }}"

      # 3. Crear usuario (POST)
      - post:
          url: "/api/companies"
          headers:
            Authorization: "Bearer {{ fixedToken }}"
          json:
            bussines_name: " Recicladora"
            document_number: "102301242"
            profession: "Vendedor"
            years_experience: 1
            email: "recicladorara@gmail.com"
            password: "recicla23"
            doc_type_id: 1
          capture:
            - json: "$.id"
              as: "newUserId"